sschiesser/SMS_nRF5_sensors/sms_sensors/main.c
static void pressure_poll_int_handler(void * p_context)
{
	pressure_poll_int_done = true;
}

static void imu_poll_int_handler(void * p_context)
{
	bno055_interrupt.new_int = true;
}

static void micros_cnt_handler(void * p_context)
{
	micros_cnt_overflow++;
}

static void timer_create(void)
{
	uint32_t err_code;
	err_code = app_timer_create(&pressure_poll_int_id, APP_TIMER_MODE_REPEATED, pressure_poll_int_handler);
	APP_ERROR_CHECK(err_code);

	err_code = app_timer_create(&imu_poll_int_id, APP_TIMER_MODE_REPEATED, imu_poll_int_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = app_timer_create(&micros_cnt_id, APP_TIMER_MODE_REPEATED, micros_cnt_handler);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;
//	// --- added ---
//	ble_advdata_manuf_data_t manuf_data;
//	// --- added ---
	
    ble_uuid_t adv_uuids[] = {{SMSS_UUID_SERVICE, m_smss.uuid_type}};
//    ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}, {APS_UUID_SERVICE, m_aps.uuid_type}};
	//, {IMUS_UUID_SERVICE, m_imus.uuid_type}};

//	// --- added ---
//	memset(&manuf_data, 0, sizeof(manuf_data));
//	char myData[] = {"SomeData!"};
//	manuf_data.company_identifier = 0x0059;
//	manuf_data.data.p_data = (uint8_t *)myData;
//	manuf_data.data.size = strlen(myData);
//	// --- added ---
	
    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;

//	// --- added ---
//	advdata.p_manuf_specific_data = &manuf_data;
//	advdata.short_name_len = 6;
	// --- added ---

    advdata.include_appearance = true;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
	
    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_set(&advdata, &scanrsp);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_lbs     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
static void led_write_handler(ble_smss_t * p_smss, uint8_t led_state)
{
    if (led_state)
    {
        bsp_board_led_on(LEDBUTTON_LED_PIN);
        NRF_LOG_INFO("Received LED ON!\r\n");
    }
    else
    {
        bsp_board_led_off(LEDBUTTON_LED_PIN);
        NRF_LOG_INFO("Received LED OFF!\r\n");
    }
}

static void pressure_write_handler(ble_smss_t * p_smss, uint8_t pressure_value)
{
}

static void imu_write_handler(ble_smss_t * p_smss, uint8_t imu_value)
{
}

static void button_write_handler(ble_smss_t * p_smss, uint8_t button_state)
{
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
	ble_smss_init_t smss_init;

	smss_init.led_write_handler = led_write_handler;
	smss_init.button_write_handler = button_write_handler;
	smss_init.press_write_handler = pressure_write_handler;
	smss_init.imu_write_handler = imu_write_handler;
	err_code = ble_smss_init(&m_smss, &smss_init);
	APP_ERROR_CHECK(err_code);
	
//	lbs_init.led_write_handler = led_write_handler;
//    err_code = ble_lbs_init(&m_lbs, &lbs_init);
//    APP_ERROR_CHECK(err_code);
//	
//	aps_init.val_write_handler = pressure_write_handler;
//	err_code = ble_aps_init(&m_aps, &aps_init);
//	APP_ERROR_CHECK(err_code);
//	
//	imus_init.val_write_handler = imu_write_handler;
//	err_code = ble_imus_init(&m_imus, &imus_init);
//	APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

