sschiesser/SMS_nRF5_sensors/sms_sensors/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON_PIN:
            NRF_LOG_INFO("Send button state change.\r\n");            
            err_code = ble_smss_on_button_change(&m_smss, button_action);
			if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

 		case LEDBUTTON_BUTTON_PIN2:
			NRF_LOG_INFO("Send button 2 state change.\r\n");
			button_action |= 0x10;
//			err_code = ble_smss_on_button_change(&m_smss, button_action);
			err_code = ble_smss_on_press_value(&m_smss, button_action);
			if(err_code != NRF_SUCCESS &&
				 err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
				 err_code != NRF_ERROR_INVALID_STATE)
			{
				APP_ERROR_CHECK(err_code);
			}
			break;

		default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    uint32_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON_PIN, false, BUTTON_PULL, button_event_handler},
 		{LEDBUTTON_BUTTON_PIN2, false, BUTTON_PULL, button_event_handler}
   };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}

void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
//    NRF_LOG_INFO("Transfer completed.\r\n");
//    if (m_rx_buf[0] != 0)
//    {
//        NRF_LOG_INFO(" Received: \r\n");
//        NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
//    }
}


void pin_change_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	bno055_interrupt.new_int = true;
//	bsp_board_led_invert(LEDBUTTON_LED_PIN);
}


static void gpio_init(void)
{
	ret_code_t err_code;
	
	nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
	in_config.pull = NRF_GPIO_PIN_PULLDOWN;
	err_code = nrf_drv_gpiote_in_init(DRDY_INT_PIN, &in_config, pin_change_handler);
	APP_ERROR_CHECK(err_code);
	
	bno055_interrupt.new_int = false;
	nrf_drv_gpiote_in_event_enable(DRDY_INT_PIN, true);
}

/**@brief Function for initializing the SPI module.
 */
static void spi_init(void)
{
	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	spi_config.ss_pin = SPI_SS_PIN;
	spi_config.miso_pin = SPI_MISO_PIN;
	spi_config.mosi_pin = SPI_MOSI_PIN;
	spi_config.sck_pin = SPI_SCK_PIN;
	spi_config.mode = NRF_DRV_SPI_MODE_0;
	spi_config.frequency = NRF_DRV_SPI_FREQ_500K;
	APP_ERROR_CHECK(nrf_drv_spi_init(&spi_master_instance, &spi_config, spi_event_handler));
}



/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


static void ms58_reset(void)
{
//	NRF_LOG_INFO("Resetting MS58\n\r");
	uint8_t tx_len = 1;
	uint8_t rx_len = 0;
	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_RESET;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	nrf_delay_ms(4);
}

static void ms58_read_prom(void)
{
	uint8_t tx_len = 1;
	uint8_t rx_len = 3;
	
	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_PROM_READ_1;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	ms58_output.prom_values[1] = (m_rx_buf[1] << 8 | m_rx_buf[2]);
		
	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_PROM_READ_2;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	ms58_output.prom_values[2] = (m_rx_buf[1] << 8 | m_rx_buf[2]);

	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_PROM_READ_3;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	ms58_output.prom_values[3] = (m_rx_buf[1] << 8 | m_rx_buf[2]);

	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_PROM_READ_4;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	ms58_output.prom_values[4] = (m_rx_buf[1] << 8 | m_rx_buf[2]);

	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_PROM_READ_5;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	ms58_output.prom_values[5] = (m_rx_buf[1] << 8 | m_rx_buf[2]);

	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_PROM_READ_6;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
	ms58_output.prom_values[6] = (m_rx_buf[1] << 8 | m_rx_buf[2]);


	// Send the first conversion command
	tx_len = 1;
	rx_len = 0;
	m_tx_buf[0] = MS58_CONV_D1_4096;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
}

static void ms58_read_data(void)
{
	uint8_t tx_len = 4;
	uint8_t rx_len = 4;
	
	memset(m_rx_buf, 0, rx_len);
	m_tx_buf[0] = MS58_ADC_READ;
	m_tx_buf[1] = MS58_ADC_READ;
	m_tx_buf[2] = MS58_ADC_READ;
	m_tx_buf[3] = MS58_ADC_READ;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};

	if(ms58_output.complete) {
		ms58_output.adc_values[MS58_TYPE_PRESS] = ((m_rx_buf[1] << 16) | (m_rx_buf[2] << 8) | (m_rx_buf[3]));
//		SEGGER_RTT_printf(0, "ADC value[MS58_TYPE_TEMP]: 0x%02x %02x %02x\n", m_rx_buf[1], m_rx_buf[2], m_rx_buf[3]);
		m_tx_buf[0] = MS58_CONV_D2_4096;
	}
	else {
		ms58_output.adc_values[MS58_TYPE_TEMP] = ((m_rx_buf[1] << 16) | (m_rx_buf[2] << 8) | (m_rx_buf[3]));
//		SEGGER_RTT_printf(0, "ADC value[MS58_TYPE_PRESS]: 0x%02x %02x %02x\n", m_rx_buf[1], m_rx_buf[2], m_rx_buf[3]);
		m_tx_buf[0] = MS58_CONV_D1_4096;
	}
	tx_len = 1;
	rx_len = 0;
	spi_xfer_done = false;
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_master_instance, m_tx_buf, tx_len, m_rx_buf, rx_len));
	while(!spi_xfer_done) {};
}

