sschiesser/SMS_nRF5_sensors/sms_sensors/main.c
static void ms58_calculate(void)
{
    /***************************************************************************
    * Calculated values...
    * Note: - ms58_prom_values[] are uint16_t
    *       - ms58_adc_values[] are uint32_t
    * Typical values given on the MS5003-01BA datasheets (March 25, 2013) are:
    * -------------------------------------------------------------------------
    * ms58_prom_values[]          |   ms58_adc_values[]
    * - C1 = 40'127 (SENSt1)      |   - D1 = 9'085'466 (Digital pressure)
    * - C2 = 36'924 (OFFt1)       |   - D2 = 8'569'150 (Digital temperature)
    * - C3 = 23'317 (TCS)         |
    * - C4 = 23'282 (TCO)         |
    * - C5 = 33'464 (Tref)        |
    * - C6 = 28'312 (TEMPSENS)    |
    **************************************************************************/
    int32_t deltaT;
    int64_t offset, sensitivity, tv1, tv2, tv3;

    /***************************
    * Temperature calculation *
    ***************************/
    /* dT = D2 - Tref = D2 - C5*2^8 */
    /* tv1: 33464 * 2^8 = 8566784 */
    tv1 = ((int64_t)(ms58_output.prom_values[5]) << 8);
    /* deltaT: 8569150 - 8566784 = 2366 */
    deltaT = (int32_t)((int64_t)ms58_output.adc_values[MS58_TYPE_TEMP] - tv1);

    /* TEMP = 20°C + dT*TEMPSENS = 2000 + dT * C6/2^23 */
    /* tv1: 28312 * 2366 = 66986192 */
    tv1 = ((int64_t)ms58_output.prom_values[6] * (int64_t)deltaT);
    /* tv2: 66986192 / 2^23 = 7(.985376358) */
    tv2 = (tv1 >> 23);
    /* temp: 7 + 2000 = 2007 */
    ms58_output.temperature = (int32_t)(tv2 + 2000);

    /************************
    * Pressure calculation *
    ************************/
    /* OFF = OFFt1 + TCO*dT = C2*2^16 + (C4*dT)/2^7 */
    /* tv1: 36924 * 2^16 = 2419851264 */
    tv1 = ((int64_t)(ms58_output.prom_values[2]) << 16);
    /* tv2: 23282 * 2366 = 55085212 */
    tv2 = ((int64_t)ms58_output.prom_values[4] * (int64_t)deltaT);
    /* tv3: 55085212 / 2^7 = 430353(.21875) */
    tv3 = (tv2 >> 7);
    /* offset: 2419851264 + 430353 = 2420281617 */
    offset = (tv1 + tv3);

    /* SENS = SENSt1 + TCS*dT = C1*2^15 + (C3*dT)/2^8 */
    /* tv1: 40127 * 2^15 = 1314881536 */
    tv1 = ((int64_t)(ms58_output.prom_values[1]) << 15);
    /* tv2: 23317 * 2366 = 55168022 */
    tv2 = ((int64_t)ms58_output.prom_values[3] * (int64_t)deltaT);
    /* tv3: 55168022 / 2^8 = 215500(.0859375) */
    tv3 = (tv2 >> 8);
    /* sensitivity: 1314881536 + 215500 = 1315097036 */
    sensitivity = (tv1 + tv3);

    /* P = D1*SENS - OFF = (D1*SENS/2^21 - OFF)/2^15 */
    /* tv1: (9085466 * 1315097036) / 2^21 = 5697378829(.612148284) */
    tv1 = (((int64_t)ms58_output.adc_values[MS58_TYPE_PRESS] * sensitivity) >> 21);
    /* tv2: 5697378829 - 2420281617 = 3277097212 */
    tv2 = tv1 - offset;
    /* press: 3277097212 / 2^15 = 100009(.070190) */
    ms58_output.pressure = (int32_t)(tv2 >> 15);
}



/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Initialize.
    leds_init();
    timers_init();
	timer_create();
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    buttons_init();

	SEGGER_RTT_printf(0, "Initializing BLE...\n");
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
	
	spi_init();
	ms58_reset();
	ms58_read_prom();
	ms58_output.complete = false;

	twi_init();
	bno055_reset();
	nrf_delay_ms(500);
	int ret = bno055_check();
	if(!ret)
	{
		SEGGER_RTT_printf(0, "Whole BNO055 device is present\n");
		nrf_delay_ms(1000);
		bno055_test();
		nrf_delay_ms(1000);
		bno055_init_config_values();
//		bno055_calibrate_accel_gyro(bno055_config.accel_bias, bno055_config.gyro_bias);
//		nrf_delay_ms(1000);
//		bno055_calibrate_mag(bno055_config.mag_bias);
//		nrf_delay_ms(1000);
		
		// Check calibration status of the sensors
		uint8_t calstat = readByte(BNO055_ADDRESS, BNO055_CALIB_STAT);
		SEGGER_RTT_printf(0, "Not calibrated = 0, fully calibrated = 3\n");
		SEGGER_RTT_printf(0, "System calibration status: %d\n", ((0xC0 & calstat) >> 6));
		SEGGER_RTT_printf(0, "Gyro   calibration status: %d\n", ((0x30 & calstat) >> 4));
		SEGGER_RTT_printf(0, "Accel  calibration status: %d\n", ((0x0C & calstat) >> 2));
		SEGGER_RTT_printf(0, "Mag    calibration status: %d\n", ((0x03 & calstat) >> 0));

		// Initialize bno055
		bno055_initialize();
		SEGGER_RTT_printf(0, "BNO055 initialized for sensor mode....");
	}
	else {
		if((ret & 0x08) == 0x08) {
			SEGGER_RTT_printf(0, "NO DEVICE AT ALL!!\n");
		}
		else {
			if((ret & 0x04) == 0x04) {
				SEGGER_RTT_printf(0, "No accelerometer\n");
			}
			if((ret & 0x02) == 0x02) {
				SEGGER_RTT_printf(0, "No magnetometer\n");
			}
			if((ret & 0x01) == 0x01) {
				SEGGER_RTT_printf(0, "No gyroscope\n");
			}
		}
	}
	
	gpio_init();
	
	app_timer_start(pressure_poll_int_id, APP_TIMER_TICKS(MSEC_TO_UNITS(67, UNIT_1_00_MS),0), NULL);
	app_timer_start(imu_poll_int_id, APP_TIMER_TICKS(MSEC_TO_UNITS(71, UNIT_1_00_MS),0), NULL);
	app_timer_start(micros_cnt_id, 0xffffffff, NULL);
	nrf_drv_timer_compare(&TIMER_DELTA_US, NRF_TIMER_CC_CHANNEL0, 1000000, true);
	nrf_drv_timer_enable(&TIMER_DELTA_US);
	

    // Start execution.
    NRF_LOG_INFO("Blinky Start!\r\n");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
		
		if(pressure_poll_int_done) {
			pressure_poll_int_done = false;
			ms58_read_data();
			if(ms58_output.complete) {
				ms58_calculate();
//				SEGGER_RTT_printf(0, "Pressure: %ld, Temperature: %ld\n", ms58_output.pressure, ms58_output.temperature);
//				SEGGER_RTT_printf(0, "Sending: %d\n", aps_cnt);
//				err_code = ble_aps_on_new_value(&m_aps, aps_cnt);
//				if (err_code != NRF_SUCCESS &&
//					err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
//					err_code != NRF_ERROR_INVALID_STATE)
//				{
//					APP_ERROR_CHECK(err_code);
//				}
//				aps_cnt += 1;
				ms58_output.complete = false;
			}
			else {
				ms58_output.complete = true;
			}
		}
		
		if(bno055_interrupt.new_int) {
//			SEGGER_RTT_printf(0, "BNO055 interrupt!\n");
			bno055_interrupt.new_int = false;
			bno055_poll_data();
			bno055_int_reset();
		}
    }
}


/**
 * @}
 */
